OpenFOAM-5.x/tutorials/lagrangian/reactingParcelFoam/filter/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alphat
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
epsilon
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
G
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
H2O
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
k
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
nut
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
N2
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
O2
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
p
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
T
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform 0;
        }
        cycRight
        {
            type            cyclic;
            value           uniform 0;
        }
    }
}
U
{
    boundaryField
    {
        cycLeft
        {
            type            cyclic;
            value           uniform (0 0 0);
        }
        cycRight
        {
            type            cyclic;
            value           uniform (0 0 0);
        }
    }
}

// ************************************************************************* //
